carrotstick_api/app/controllers/habits_controller.rb

SELECT "habits".* FROM "habits" WHERE "habits"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "habits".* FROM "habits"
---
  def index
    if params[:user_id]
      render json: @habits = User.find(params[:user_id]).habits
    else
      @habit = Habit.all

INSERT INTO "habits" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "wake up early"], ["created_at", "2020-01-15 15:22:32.259394"], ["updated_at", "2020-01-15 15:22:32.259394"]]
---
  def create
    @habit = Habit.new(habit_params)

    if @habit.save

SELECT "habits".* FROM "habits" WHERE "habits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_habit
      @habit = Habit.find(params[:id])