carrotstick_api/app/controllers/logs_controller.rb

  def index
    @logs = Log.all
---
SELECT "logs".* FROM "logs"